<template>
  <div>
    <swiper :options ="swiperOption" class="swiper" >
      <swiper-slide class="text">
          <div class="centent">
    【学习进行时】8月21日至22日，全国宣传思想工作会议召开，习近平总书记在会上发表重要讲话，对新形势下党的宣传思想工作作出重大部署，强调推动宣传思想工作不断强起来，促进全体人民在理想信念、价值理念、道德观念上紧紧团结在一起。新华社《学习进行时》原创品牌栏目“讲习所”为您梳理总书记划出的重点。

    根本遵循：九个“坚持”

    ●坚持党对意识形态工作的领导权

    ●坚持思想工作“两个巩固”的根本任务

    ●坚持用新时代中国特色社会主义思想武装全党、教育人民

    ●坚持培育和践行社会主义核心价值观

    ●坚持文化自信是更基础、更广泛、更深厚的自信，是更基本、更深沉、更持久的力量

    ●坚持提高新闻舆论传播力、引导力、影响力、公信力

    ●坚持以人民为中心的创作导向

    ●坚持营造风清气正的网络空间

    ●坚持讲好中国故事、传播好中国声音

    中心环节：统一思想、凝聚力量

    ●必须把人民对美好生活的向往作为我们的奋斗目标，既解决实际问题又解决思想问题，更好强信心、聚民心、暖人心、筑同心。

    ●必须既积极主动阐释好中国道路、中国特色，又有效维护我国政治安全和文化安全。

    ●必须坚持以立为本、立破并举，不断增强社会主义意识形态的凝聚力和引领力。

    ●必须科学认识网络传播规律，提高用网治网水平，使互联网这个最大变量变成事业发展的最大增量。

    使命任务：举旗帜、聚民心、育新人、兴文化、展形象

    ●举旗帜，就是要高举马克思主义、中国特色社会主义的旗帜，坚持不懈用新时代中国特色社会主义思想武装全党、教育人民、推动工作，在学懂弄通做实上下功夫，推动当代中国马克思主义、21世纪马克思主义深入人心、落地生根。

    ●聚民心，就是要牢牢把握正确舆论导向，唱响主旋律，壮大正能量，做大做强主流思想舆论，把全党全国人民士气鼓舞起来、精神振奋起来，朝着党中央确定的宏伟目标团结一心向前进。

    ●育新人，就是要坚持立德树人、以文化人，建设社会主义精神文明、培育和践行社会主义核心价值观，提高人民思想觉悟、道德水准、文明素养，培养能够担当民族复兴大任的时代新人。

    ●兴文化，就是要坚持中国特色社会主义文化发展道路，推动中华优秀传统文化创造性转化、创新性发展，继承革命文化，发展社会主义先进文化，激发全民族文化创新创造活力，建设社会主义文化强国。

    ●展形象，就是要推进国际传播能力建设，讲好中国故事、传播好中国声音，向世界展现真实、立体、全面的中国，提高国家文化软实力和中华文化影响力。

    战略任务：建设具有强大凝聚力和引领力的社会主义意识形态

    ●做好做强马克思主义宣传教育工作，特别是要在学懂弄通做实新时代中国特色社会主义思想上下功夫。

    ●把坚定“四个自信”作为建设社会主义意识形态的关键，坚持马克思主义在我国哲学社会科学领域的指导地位，建设具有中国特色、中国风格、中国气派的哲学社会科学。

    ●把握正确舆论导向，提高新闻舆论传播力、引导力、影响力、公信力，巩固壮大主流思想舆论。

    ●加强传播手段和话语方式创新，让党的创新理论“飞入寻常百姓家”。

    ●扎实抓好县级融媒体中心建设，更好引导群众、服务群众。

    ●旗帜鲜明坚持真理，立场坚定批驳谬误。

    ●压实压紧各级党委（党组）责任，做到任务落实不马虎、阵地管理不懈怠、责任追究不含糊。

    重要职责：培养担当民族复兴大任的时代新人

    ●重中之重是要以坚定的理想信念筑牢精神之基，坚定对马克思主义的信仰，对社会主义和共产主义的信念，对中国特色社会主义道路、理论、制度、文化的自信。

    ●强化教育引导、实践养成、制度保障，把社会主义核心价值观融入社会发展各方面，引导全体人民自觉践行。

    ●抓住青少年价值观形成和确定的关键时期，引导青少年扣好人生第一粒扣子。

    ●广泛开展先进模范学习宣传活动，营造崇尚英雄、学习英雄、捍卫英雄、关爱英雄的浓厚氛围。

    ●大力弘扬时代新风，加强思想道德建设，深入实施公民道德建设工程，加强和改进思想政治工作，推进新时代文明实践中心建设，不断提升人民思想觉悟、道德水准、文明素养和全社会文明程度。

    ●弘扬新风正气，推进移风易俗，培育文明乡风、良好家风、淳朴民风，焕发乡村文明新气象。

    做好文化工作

    ●引导广大文化文艺工作者深入生活、扎根人民，把提高质量作为文艺作品的生命线，用心用情用功抒写伟大时代，不断推出讴歌党、讴歌祖国、讴歌人民、讴歌英雄的精品力作，书写中华民族新史诗。

    ●坚持把社会效益放在首位，引导文艺工作者树立正确的历史观、民族观、国家观、文化观，自觉讲品位、讲格调、讲责任，自觉遵守国家法律法规，加强道德品质修养，坚决抵制低俗庸俗媚俗，用健康向上的文艺作品和做人处事陶冶情操、启迪心智、引领风尚。

    ●推出更多健康优质的网络文艺作品。

    ●推动公共文化服务标准化、均等化，坚持政府主导、社会参与、重心下移、共建共享，完善公共文化服务体系，提高基本公共文化服务的覆盖面和适用性。

    ●推动文化产业高质量发展，健全现代文化产业体系和市场体系，推动各类文化市场主体发展壮大，培育新型文化业态和文化消费模式，以高质量文化供给增强人们的文化获得感、幸福感。

    ●坚定不移将文化体制改革引向深入，不断激发文化创新创造活力。

    不断提升中华文化影响力

    ●把握大势、区分对象、精准施策，主动宣介新时代中国特色社会主义思想，主动讲好中国共产党治国理政的故事、中国人民奋斗圆梦的故事、中国坚持和平发展合作共赢的故事，让世界更好了解中国。

    ●把优秀传统文化的精神标识提炼出来、展示出来，把优秀传统文化中具有当代价值、世界意义的文化精髓提炼出来、展示出来。

    ●完善国际传播工作格局，创新宣传理念、创新运行机制，汇聚更多资源力量。

    加强党对宣传思想工作的全面领导

    ●旗帜鲜明坚持党管宣传、党管意识形态。

    ●以党的政治建设为统领，牢固树立“四个意识”，坚决维护党中央权威和集中统一领导，牢牢把握正确政治方向。

    ●加强作风建设，坚决纠正“四风”特别是形式主义、官僚主义。

    ●宣传思想干部要不断掌握新知识、熟悉新领域、开拓新视野，增强本领能力，加强调查研究，不断增强脚力、眼力、脑力、笔力，努力打造一支政治过硬、本领高强、求实创新、能打胜仗的宣传思想工作队伍。
          </div>
      </swiper-slide>
    </swiper>
  </div>
</template>

<script>
  import 'swiper/dist/css/swiper.css'
  import { swiper, swiperSlide } from 'vue-awesome-swiper'
  export default {
      data() {
          return {
              swiperOption: {
                  direction:'vertical',
                  slidesPerView:"auto",
                  freeMode:true,
                  mousewheel:true
              },

          }
      },
    components:{
      swiper, swiperSlide
    }
  }
</script>

<style scoped>
  .swiper{
      height: 300px;
      overflow: hidden;
  }
  .text{
      font-size: 18px !important;
      text-align: left;
      padding:30px;
      height: auto;
      -webkit-box-sizing: border-box;
      box-sizing: border-box;

  }
</style>
